---
kind: property
id: P:Autodesk.Revit.DB.Visual.Metal.MetalPatternShader
source: html/f4a3a017-d2b5-2d23-6b11-772237b48eae.htm
---
# Autodesk.Revit.DB.Visual.Metal.MetalPatternShader Property

The property labeled "Image" from the "Metal" schema.

## Syntax (C#)
```csharp
public static string MetalPatternShader { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.